Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean,Autodesk.Revit.DB.XYZ)
Creates a non rectangular profile wall within the project using the specified wall type and normal vector.
document:
The document in which the new wall is created.
profile:
An array of planar curves that represent the vertical profile of the wall.
wallTypeId:
Id of the wall type to be used by the new wall instead of the default type.
levelId:
Id of the level on which the wall is to be placed.
structural:
If set, specifies that the wall is structural in nature.
normal:
A vector that must be perpendicular to the profile which dictates which side of the wall is considered to be inside and outside.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a non rectangular profile wall within the project using the specified wall type.
document:
The document in which the new wall is created.
profile:
An array of planar curves that represent the vertical profile of the wall.
wallTypeId:
Id of the wall type to be used by the new wall instead of the default type.
levelId:
Id of the level on which the wall is to be placed.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},System.Boolean)
Creates a non rectangular profile wall within the project using the default wall type.
document:
The document in which the new wall is created.
profile:
An array of planar curves that represent the vertical profile of the wall.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Double,System.Double,System.Boolean,System.Boolean)
Creates a new rectangular profile wall within the project using the specified wall type, height, and offset.
document:
The document in which the new wall is created.
curve:
A curve representing the base line of the wall.
wallTypeId:
Id of the wall type to be used by the new wall instead of the default type.
levelId:
Id of the level on which the wall is to be placed.
height:
The height of the wall other than the default height.
offset:
Modifies the wall's Base Offset parameter to determine its vertical placement.
flip:
Change which side of the wall is considered to be the inside and outside of the wall.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The curve argument is not valid for wall creation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for height must be greater than 0 and no more than 30000 feet.
-or-
The given value for offset must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a new rectangular profile wall within the project using the default wall style.
document:
The document in which the new wall is created.
curve:
A curve representing the base line of the wall.
levelId:
Id of the level on which the wall is to be placed.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The curve argument is not valid for wall creation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.